# Написать программу на Python, которая будет проводить сканирование с использованием nmap.

print(123)